# Задача 1
num = int(input("Введите число: "))
print("Четное" if num % 2 == 0 else "Нечетное")

# Задача 2
a = float(input("Первое число: "))
b = float(input("Второе число: "))
print(max(a, b))

# Задача 3
age = int(input("Ваш возраст: "))
print("Можно получить права" if age >= 18 else "Нельзя получить права")# Задача 1
num = int(input("Введите число: "))
print("Четное" if num % 2 == 0 else "Нечетное")

# Задача 2
a = float(input("Первое число: "))
b = float(input("Второе число: "))
print(max(a, b))

# Задача 3
age = int(input("Ваш возраст: "))
print("Можно получить права" if age >= 18 else "Нельзя получить права")