# Задача 1
print("Hello, World!")

# Задача 2
name = input("Введите ваше имя: ")
print(f"Привет, {name}!")