# Задача 1
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
print(f"Сумма: {num1 + num2}")

# Задача 2
number = int(input("Введите число: "))
print(type(number))

# Задача 3
age = int(input("Сколько вам лет? "))
print(f"Вам {age} лет.")